# Принимает параметр A, например, [1,3,4,7]
# Принимает параметр B, например, [3,5,6,7,8]
# Не возвращает значение
# Выводит в консоль пересечение множества A v B = [
#   (1, 3), (1, 5), (1, 6), (1, 7), (1, 8),
#   (3, 3), (3, 5), (3, 6), (3, 7), (3, 8),
#   (4, 3), (4, 5), (4, 6), (4, 7), (4, 8),
#   (7, 3), (7, 5), (7, 6), (7, 7), (7, 8)
# ]
# Выводит в консоль мощность |A x B| = 20
def AxB(A, B):
    
    power = 0 # мощность - |A x B|

    print("%a x %a =" % (A, B))
    print("= [")

    for i in range(len(A)):
        print("\t", end = "")
        for j in range(len(B)):
            power += 1

            print("(%d, %d)" % (A[i], B[j]), end = "")

            # Вывод запятой, если это не последний элемент
            if (i != len(A) - 1) or (j != len(B) - 1):
                print(", ", end = "")

        print() # перевод строки

    print("]")

    print("|%a x %a| = %d" % (A, B, power))
