import numpy

# Функция принимает параметры
# A - множество, например, A = [1,2,3,4,5,6,7,8,9,10]

# Возвращает отношение a = b (mod 3) в виде двумерного массива с нулями и единицами

# Например множество A = [1,2,3,4,5,6]
# Тогда функция возвратит [(3, 3), (3, 6), (6, 3), (6, 6)]
#[[0 0 0 0 0 0]
# [0 0 0 0 0 0]
# [0 0 1 0 0 1]
# [0 0 0 0 0 0]
# [0 0 0 0 0 0]
# [0 0 1 0 0 1]]
def get_R1(A):
    R1 = numpy.zeros( (len(A), len(A)), dtype = numpy.int )
    for i in range(len(R1)):
        for j in range(len(R1[i])):
            a = A[i]
            b = A[j]
            if a % 3 == 0 and b % 3 == 0:
                R1[i][j] = 1
    return R1