# Функция принимает параметры
# A - множество, например, A = [1,2,3,4,5,6,7,8,9,10]
# arr - массив состоящий из нулей и единиц

# Возвращает отношение (пары из массива)
# (Получим массив пар, если arr[i][j] = 1 - это картедж (A[i], A[j]))

# Например, множество A = [1,2,3,4,5,6]
# Массив arr =
#[[0 0 0 0 0 0]
# [1 0 0 0 0 0]
# [0 0 0 0 0 0]
# [0 1 0 0 0 0]
# [0 0 0 0 0 0]
# [0 0 1 0 0 0]]
# Тогда функция возвратит [(2, 1), (4, 2), (6, 3)]
def get_couple(A, arr):
    data = []
    for i in range(len(arr)):
        for j in range(len(arr[i])):
            if arr[i][j] == 1:
                data.append( (A[i], A[j]) )
    return data
